2013/09/Sep13.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Research notes: September 2013</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Research notes: September 2013"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-05 14:38:29 BST"/>
<meta name="author" content="N. Seymour-Smith"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/styles.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Research notes: September 2013</h1>


<hr>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Thursday 5th</a>
<ul>
<li><a href="#sec-1-1">General simulations rewrite</a></li>
<li><a href="#sec-1-2">Inconsistency in Heat Engine simulation solved, still no oscillation</a></li>
</ul>
</li>
<li><a href="#sec-2">To do: Molecule lab</a>
<ul>
<li><a href="#sec-2-1">Interferometer</a>
<ul>
<li><a href="#sec-2-1-1">Re-optimise around trap</a></li>
<li><a href="#sec-2-1-2">Check chromatic abberation</a></li>
</ul>
</li>
<li><a href="#sec-2-2">Photoionisation of N2</a>
<ul>
<li><a href="#sec-2-2-1">Explain photoionisation process</a></li>
<li><a href="#sec-2-2-2">Replace damaged optical elements in laser</a></li>
<li><a href="#sec-2-2-3">Re-take spectra with better S-N</a></li>
</ul>
</li>
<li><a href="#sec-2-3">Code an automation program for experiments</a>
<ul>
<li><a href="#sec-2-3-1">Fast autocorrelation calculation</a></li>
<li><a href="#sec-2-3-2">Describe phonon laser trick in notes</a></li>
</ul>
</li>
<li><a href="#sec-2-4">Simulations</a>
<ul>
<li><a href="#sec-2-4-1">Single ion `heat-engine' effect</a></li>
<li><a href="#sec-2-4-2">Hanle dip/b-field map simulation</a></li>
<li><a href="#sec-2-4-3">One or two calcium ions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Thursday 5th</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">General simulations rewrite &nbsp;&nbsp;&nbsp;<span class="tag"><span class="logs">logs</span></span></h3>
<div class="outline-text-3" id="text-1-1">

<p>As per the plan (only entry in August), I have cleaned up all my
Matlab simulations for spectra and molecular dynamics. Simulations
that use the quantum optics toolbox now all use external scripts to
compose the various components of the Liouvillian that are
relevant. Putting together the final Liouvillian is left in the main
body of code, as is any actual MD or simple-harmonic motion
simulations, since that is the real meat of any of these codes. 
</p>
<p>
The old molecular dynamics codes have been cleaned up and
redundant/obsolete versions moved into labelled folders. Also, most
simulations have been separated into scripts labelled with either
"<sub>MD</sub>" or "<sub>SHO</sub>", which denote whether the mechanics are regular
newtonian molecular dynamics or simple-harmonic oscillator,
respectively. 
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Inconsistency in Heat Engine simulation solved, still no oscillation &nbsp;&nbsp;&nbsp;<span class="tag"><span class="logs">logs</span></span></h3>
<div class="outline-text-3" id="text-1-2">

<p>At some point I probably wrote a log stating that there was an
inconsistency in the population of the excited state during my
heat-engine simulation when compared with my simple spectroscopy
simulation. I found the inconsistency was in how I calculated the Rabi
frequency of the repumper laser. This has now been fixed across all
simulations, and results are consistent. 
</p>
<p>
This has allowed me to use the spectroscopy simulation to pick good
parameters for the heat-engine simulation, and determine that there is
indeed very little, or no, contribution to the ion motion coming from
the dipole force in the 1D regime. 
</p>
<p>
The next step is to add a second dimension to the simulation, which
shouldn't be too difficult, but might have to be done over the next
week at the conference.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">To do: Molecule lab</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="todo TODO">TODO</span> Interferometer &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Nic">Nic</span></span></h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="todo TODO">TODO</span> Re-optimise around trap</h4>
<div class="outline-text-4" id="text-2-1-1">

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="todo TODO">TODO</span> Check chromatic abberation</h4>
<div class="outline-text-4" id="text-2-1-2">

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="todo TODO">TODO</span> Photoionisation of N2 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Nic">Nic</span>&nbsp;<span class="Amy">Amy</span></span></h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="todo TODO">TODO</span> Explain photoionisation process</h4>
<div class="outline-text-4" id="text-2-2-1">

<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-07-01 Mon</span></span>
</li>
</ul>

<p>Draw up diagram with our options, write-up including selection rules
(see Matthias).
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-07-31 Wed</span></span>
</li>
</ul>

<p>Some notes are in my logbook - need to write those up.
</p></div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="done DONE">DONE</span> Replace damaged optical elements in laser</h4>
<div class="outline-text-4" id="text-2-2-2">

<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-06-21 Fri</span></span>
</li>
</ul>

<p>Waiting on parts
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-08-06 Tue</span></span>
</li>
</ul>

<p>Parts arrived last week. They will be replaced next time the dye is
changed. This is more or less handed over to Amy however.
</p></div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="todo TODO">TODO</span> Re-take spectra with better S-N</h4>
<div class="outline-text-4" id="text-2-2-3">

</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="todo TODO">TODO</span> Code an automation program for experiments &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Nic">Nic</span>&nbsp;<span class="Kevin">Kevin</span></span></h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="todo TODO">TODO</span> Fast autocorrelation calculation</h4>
<div class="outline-text-4" id="text-2-3-1">

<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-04-09 Tue</span></span>
</li>
</ul>

<p>[X] Try using CUDA for a fast autocorrelation calculation 
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-04-09 Tue</span></span>
</li>
</ul>

<p>Maybe first just try using Wolfgang's code. It might just be fast
enough on its own.
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-07-31 Wed</span></span>
</li>
</ul>

<p>Hiroki has refactored Wolfgang's code into sub-functions and I'm now
using his DLL. I tried running a few tests with python but it's really
way too slow for large datasets.
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-08-28 Wed</span></span>
</li>
</ul>

<p>I've managed to make this work for a test data set in ascii using my
own dll extracted from Wolfgang and Hiroki's code. It should speed up
once I make it use binary data.
</p></div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="done CNCL">CNCL</span> Describe phonon laser trick in notes</h4>
<div class="outline-text-4" id="text-2-3-2">

<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-05-15 Wed</span></span>
</li>
</ul>

<p>Check if I already have.
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-06-10 Mon</span></span>
</li>
</ul>

<p>Only really required if it turns out to be usable. Waiting on Kevin's
results. 
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-07-31 Wed</span></span>
</li>
</ul>

<p>Not needed until the paper is written.
</p></div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="todo TODO">TODO</span> Simulations &nbsp;&nbsp;&nbsp;<span class="tag"><span class="Nic">Nic</span></span></h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="todo TODO">TODO</span> Single ion `heat-engine' effect</h4>
<div class="outline-text-4" id="text-2-4-1">

<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-05-30 Thu</span></span>
</li>
</ul>

<p>Does the oscillation have something to do with a kind of `parametric'
excitation from the laser pressure - Perhaps the ion only feels force
from the laser when it is at the edges of its oscillation (no Doppler
shift).
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-07-31 Wed</span></span>
</li>
</ul>

<p>Still working on this, but got the dipole force nearly in
properly. Need to compare ways of calculating dipole force to make
sure they agree. If we don't see the effect with a 1D model, then
maybe we need to think about a 3D model (which Matthias reckons is the
only model that should fit). 
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-08-30 Fri</span></span>
</li>
</ul>

<p>Matthias and I have agreed that I should refactor this general
simulation code so that it is clean and legible, then hand it over to
one of the students before I go. We've decided this should be Will. I
will find the time to do this, probably after handing over the
automation software to Amy.
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-09-05 Thu</span></span>
</li>
</ul>

<p>Code has been refactored and cleaned up along with the rest. Time to
add a second dimension the simulation and see if that gives us the
effect we see in the trap.
</p>
</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="done HOLD">HOLD</span> Hanle dip/b-field map simulation</h4>
<div class="outline-text-4" id="text-2-4-2">

<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-07-31 Wed</span></span>
</li>
</ul>

<p>Waiting on Kevin to make some measurements to see if they match my
simulations. 
</p><ul>
<li id="sec-2-4-2-1"><span class="done HOLD">HOLD</span> Fluorescence as a function of B-field for different light pol.<br/>
<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-06-21 Fri</span></span>
</li>
</ul>

<p>Done for now, need to talk about Matthias about results seen.
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-07-01 Mon</span></span>
</li>
</ul>

<p>Need to find a way of combining maps from different polarisations and
directions to give independent B-field direction data.
</p></li>
</ul>
</div>

</div>

<div id="outline-container-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="done CNCL">CNCL</span> One or two calcium ions</h4>
<div class="outline-text-4" id="text-2-4-3">

<ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-03-22 Fri</span></span>
</li>
</ul>

<p>Although an extra ion will reduce the acceleration of the crystal due
to the dipole force, is the increase in signal a good trade-off?
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-05-28 Tue</span></span>
</li>
</ul>

<p>This question is not important if the `phonon-laser'-like approach
we're going to try and take works well. This idea is on hold until
more work is done there.
</p><ul>
<li><span class="timestamp-wrapper"> <span class="timestamp">2013-09-05 Thu</span></span>
</li>
</ul>

<p>Not going to be time for this, and probably not neccessary.
</p>
</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-09-05 14:38:29 BST</p>
<p class="author">Author: N. Seymour-Smith</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
